{
    "data": [
        {
            "image": "https://i.ibb.co/LNsZYKL/435123131-957136245953938-8313579374460895802-n.png",
            "estate_title": "Luxury Villa",
            "id": "001",
            "segment_name": "Single-family homes",
            "description": "A luxurious villa with stunning views",
            "price": "$1,500,000",
            "status": "sale",
            "area": "5000 sq ft",
            "location": "Los Angeles, CA",
            "facilities": [
                "living room",
                "swimming pool",
                "kitchen"
            ],
            "full_description": "Perched atop the Hollywood Hills, this luxurious villa offers the epitome of upscale living. Spread across 5000 square feet, this architectural masterpiece boasts panoramic views of the Los Angeles skyline and the Pacific Ocean. With its sleek modern design and state-of-the-art amenities, every detail of this home exudes elegance and sophistication. Step through the grand entrance into the spacious living area, featuring floor-to-ceiling windows that flood the space with natural light and frame the breathtaking views. The gourmet kitchen is a chef's dream, equipped with top-of-the-line appliances and ample counter space. The expansive outdoor terrace is perfect for entertaining, with a sparkling infinity pool, multiple seating areas, and a built-in barbecue grill. Retreat to the lavish master suite, complete with a private balcony, spa-like bathroom, and walk-in closet. Additional highlights include a home theater, wine cellar, and smart home technology throughout. Located just minutes from the vibrant energy of Hollywood and Beverly Hills, this villa offers the ultimate blend of privacy and convenience.",
            "position": {
                "lat": 34.0522,
                "lng": -118.2437
            }
        },
        {
            "image": "https://i.ibb.co/xg23hgV/434588543-952964312684487-4123971753150353345-n.png",
            "estate_title": "Modern Apartment",
            "id": "002",
            "segment_name": "Apartments",
            "description": "Contemporary apartment in a prime location",
            "price": "$2,500/month",
            "status": "rent",
            "area": "1000 sq ft",
            "location": "New York City, NY",
            "facilities": [
                "living room",
                "gym",
                "balcony"
            ],
            "full_description": "Welcome to urban living at its finest! This sleek and stylish apartment is situated in the heart of New York City, offering unparalleled access to the vibrant energy of the Big Apple. Boasting 1000 square feet of meticulously designed living space, this contemporary abode features an open-concept layout, flooded with natural light and adorned with modern finishes throughout. The spacious living room is perfect for relaxing or entertaining, with floor-to-ceiling windows that showcase stunning city views. Prepare gourmet meals in the chef's kitchen, complete with stainless steel appliances, granite countertops, and ample storage space. Step outside onto your private balcony and soak in the sights and sounds of the bustling city below. After a long day of exploring, retire to the tranquil bedroom oasis, featuring plush carpeting, a walk-in closet, and a luxurious en-suite bathroom. Residents also enjoy access to a state-of-the-art fitness center, concierge services, and secure underground parking. With its unbeatable location and luxurious amenities, this modern apartment offers the ultimate urban lifestyle.",
            "position": {
                "lat": 40.7128,
                "lng": -74.006
            }
        },
        {
            "image": "https://i.ibb.co/7g2Xs4J/400812139-883378230251213-8993397747539996528-n.png",
            "estate_title": "Townhouse Retreat",
            "id": "003",
            "segment_name": "Townhouses",
            "description": "Charming townhouse with a cozy atmosphere",
            "price": "$800,000",
            "status": "sale",
            "area": "2000 sq ft",
            "location": "Chicago, IL",
            "facilities": [
                "living room",
                "garage",
                "patio"
            ],
            "full_description": "Nestled in the historic neighborhood of Lincoln Park, this charming townhouse offers a serene retreat from the hustle and bustle of city life. Steeped in character and charm, this two-story home exudes warmth and coziness from the moment you step through the door. The main level features a spacious living room with hardwood floors, exposed brick walls, and a cozy fireplace, creating the perfect ambiance for relaxing or entertaining guests. The adjacent dining area flows seamlessly into the gourmet kitchen, equipped with stainless steel appliances, granite countertops, and custom cabinetry. French doors lead out to the private patio, where you can enjoy al fresco dining or simply unwind amidst the lush greenery. Upstairs, the tranquil master suite awaits, boasting a vaulted ceiling, walk-in closet, and en-suite bathroom with a soaking tub and separate shower. Two additional bedrooms offer plenty of space for family or guests, along with a full bathroom and convenient laundry area. With its prime location, historic charm, and modern amenities, this townhouse is the perfect place to call home.",
            "position": {
                "lat": 41.8781,
                "lng": -87.6298
            }
        },
        {
            "image": "https://i.ibb.co/Rj4xh4R/433861014-404833092482985-8452375828009476079-n.png",
            "estate_title": "Student Housing Complex",
            "id": "004",
            "segment_name": "Student housing",
            "description": "Convenient and comfortable housing for students",
            "price": "$600/month",
            "status": "rent",
            "area": "800 sq ft",
            "location": "Boston, MA",
            "facilities": [
                "bedroom",
                "study area",
                "laundry room"
            ],
            "full_description": "Welcome to your home away from home! This student housing complex is ideally located just steps from campus, making it the perfect choice for college students seeking convenience and comfort. Designed with student life in mind, this modern complex offers a range of amenities to enhance your living experience. Each unit comes fully furnished with a comfortable bed, study desk, and ample storage space, allowing you to focus on your studies without worrying about furnishing your space. The spacious floor plans feature a designated study area, perfect for late-night study sessions or group projects. When it's time to relax, head to the communal lounge area, where you can hang out with friends, watch TV, or play games. Need to do laundry? No problem! The on-site laundry room makes it easy to stay on top of chores without leaving the building. With its convenient location, comfortable accommodations, and affordable rates, this student housing complex offers everything you need to thrive during your college years.",
            "position": {
                "lat": 42.3601,
                "lng": -71.0589
            }
        },
        {
            "image": "https://i.ibb.co/s1WM5V2/433665349-416395344457775-2760803485086630833-n.png",
            "estate_title": "Senior Living Community",
            "id": "005",
            "segment_name": "Senior living communities",
            "description": "A vibrant community for seniors with various amenities",
            "price": "$400,000",
            "status": "sale",
            "area": "1500 sq ft",
            "location": "Phoenix, AZ",
            "facilities": [
                "community center",
                "garden",
                "fitness center"
            ],
            "full_description": "Welcome to the good life! This vibrant senior living community offers the perfect blend of comfort, convenience, and companionship for active adults aged 55 and older. Nestled in the heart of sunny Phoenix, this resort-style community provides everything you need to live life to the fullest. From the moment you arrive, you'll be greeted by lush landscaping, scenic walking paths, and a warm and welcoming atmosphere. Step inside the spacious community center, where you'll find a wide range of amenities designed to enhance your lifestyle. Stay active and fit with access to a state-of-the-art fitness center, yoga studio, and outdoor swimming pool. Join your neighbors for a game of cards, billiards, or shuffleboard in the game room, or relax with a good book in the cozy library. Enjoy chef-prepared meals in the elegant dining room, or opt for casual fare at the on-site bistro. Outside, the beautifully landscaped grounds feature tranquil gardens, peaceful walking paths, and outdoor seating areas where you can soak up the sunshine and enjoy the company of friends. With its convenient location, luxurious amenities, and vibrant social atmosphere, this senior living community offers the ultimate retirement experience.",
            "position": {
                "lat": 33.4484,
                "lng": -112.074
            }
        },
        {
            "image": "https://i.ibb.co/fMQfCh3/435066390-1491787778411941-9022711050693438483-n.png",
            "estate_title": "Beachfront Vacation Rental",
            "id": "006",
            "segment_name": "Vacation rentals",
            "description": "Relaxing beachfront rental for the perfect getaway",
            "price": "$300/night",
            "status": "rent",
            "area": "1200 sq ft",
            "location": "Miami Beach, FL",
            "facilities": [
                "ocean view",
                "private beach access",
                "terrace"
            ],
            "full_description": "Escape to paradise with a stay at this stunning beachfront vacation rental in Miami Beach. Located just steps from the sand and surf, this luxurious retreat offers the ultimate getaway for relaxation and rejuvenation. With its sleek modern design, expansive floor-to-ceiling windows, and panoramic ocean views, this property exudes style and sophistication from every angle. The spacious open-concept living area is ideal for entertaining, with a fully equipped kitchen, stylish dining area, and comfortable seating area overlooking the ocean. Step outside onto your private terrace and feel the gentle sea breeze as you sip cocktails and watch the sunset over the horizon. When it's time to retire for the night, retreat to one of the plush bedrooms, each offering tranquil views and luxurious amenities. Wake up to the sound of waves crashing on the shore, and start your day with a leisurely stroll along the beach or a refreshing dip in the ocean. With its unbeatable location, luxurious accommodations, and breathtaking views, this beachfront vacation rental is sure to create memories that will last a lifetime.",
            "position": {
                "lat": 25.7907,
                "lng": -80.130
            }
        },
        {
            "image": "https://i.ibb.co/j5D6KZZ/434561188-447464671117931-4175622643289481365-n.png",
            "estate_title": "Cosy Cottage",
            "id": "007",
            "segment_name": "Single-family homes",
            "description": "Charming cottage nestled in the countryside",
            "price": "$350,000",
            "status": "sale",
            "area": "1800 sq ft",
            "location": "Seattle, WA",
            "facilities": [
                "fireplace",
                "garden",
                "porch"
            ],
            "full_description": "Escape the hustle and bustle of city life with a stay at this charming cottage nestled in the picturesque countryside of Seattle. Surrounded by lush greenery and towering trees, this cozy retreat offers the perfect blend of rustic charm and modern comfort. Step inside and feel instantly at home in the inviting living area, complete with a cozy fireplace, comfortable seating, and plenty of natural light. The adjacent dining area is perfect for enjoying home-cooked meals with family and friends, while the fully equipped kitchen has everything you need to whip up your favorite dishes. During the warmer months, head outside to the private garden, where you can relax on the patio, dine al fresco, or simply enjoy the tranquility of nature. Upstairs, the spacious master bedroom offers a peaceful sanctuary with a comfortable bed, plush linens, and beautiful views of the surrounding landscape. Additional amenities include a charming guest bedroom, a full bathroom, and a covered porch where you can sit back and soak in the sights and sounds of the countryside. With its idyllic location, cozy accommodations, and warm hospitality, this cottage is the perfect place to escape and unwind.",
            "position": {
                "lat": 47.6062,
                "lng": -122.3321
            }
        },
        {
            "image": "https://i.ibb.co/F4zytFs/434525147-768406965248426-3907028757762818572-n.png",
            "estate_title": "Downtown Loft",
            "id": "008",
            "segment_name": "Apartments",
            "description": "Modern loft with urban vibes in the heart of the city",
            "price": "$900,000",
            "status": "sale",
            "area": "2000 sq ft",
            "location": "San Francisco, CA",
            "facilities": [
                "open floor plan",
                "city view",
                "fitness center"
            ],
            "full_description": "Experience city living at its finest with a stay at this sleek and stylish loft in the heart of downtown San Francisco. Situated in a historic building with modern amenities, this urban oasis offers the perfect blend of comfort and convenience for discerning travelers. Step inside and be greeted by soaring ceilings, exposed brick walls, and an open-concept layout that's perfect for entertaining. The spacious living area features floor-to-ceiling windows that flood the space with natural light and offer stunning views of the city skyline. The adjacent dining area is ideal for hosting dinner parties or enjoying casual meals with friends, while the fully equipped kitchen has everything you need to prepare gourmet dishes. After a long day of exploring the city, retreat to the tranquil master suite, complete with a luxurious king-size bed, walk-in closet, and spa-like en-suite bathroom. Additional amenities include a stylish guest bedroom, a second full bathroom, and a private balcony where you can relax and soak in the sights and sounds of the city below. With its unbeatable location, modern amenities, and chic design aesthetic, this downtown loft is the perfect home base for your San Francisco adventure.",
            "position": {
                "lat": 37.7749,
                "lng": -122.4194
            }
        },
        {
            "image": "https://i.ibb.co/sJ7K7SG/434532562-987281362944101-3892278133360426503-n.png",
            "estate_title": "Lakefront Retreat",
            "id": "009",
            "segment_name": "Single-family homes",
            "description": "Tranquil retreat overlooking a serene lake",
            "price": "$1,200,000",
            "status": "sale",
            "area": "3500 sq ft",
            "location": "Lake Tahoe, CA",
            "facilities": [
                "dock",
                "deck",
                "fire pit"
            ],
            "full_description": "Escape to the breathtaking beauty of Lake Tahoe with a stay at this stunning lakefront retreat. Perched on the shores of one of the most picturesque lakes in the world, this luxurious home offers the ultimate in comfort, privacy, and serenity. Step inside and be greeted by panoramic views of the sparkling blue waters and majestic mountains that surround you. The spacious open-concept living area features vaulted ceilings, exposed wooden beams, and floor-to-ceiling windows that frame the stunning scenery. Curl up by the fireplace with a good book, gather with family and friends for movie night, or simply relax and take in the views from the comfort of the plush sofas. The gourmet kitchen is a chef's dream, with top-of-the-line appliances, granite countertops, and a large island where you can prepare delicious meals while enjoying the company of your loved ones. Step outside onto the expansive deck, where you can dine al fresco, soak in the hot tub, or gather around the fire pit and roast marshmallows under the stars. When it's time to retire for the night, the luxurious master suite awaits, complete with a king-size bed, spa-like en-suite bathroom, and private balcony overlooking the lake. Additional amenities include a guest suite, home office, and private dock where you can launch your boat or kayak and explore the crystal-clear waters of Lake Tahoe. With its unbeatable location, luxurious accommodations, and breathtaking views, this lakefront retreat is the perfect place to create lasting memories with family and friends.",
            "position": {
                "lat": 39.0968,
                "lng": -120.0324
            }
        }
    ]
}